app/Controllers/Courses.php

    private function getStudentCoursesWithDetails(){

        $builder = $this->coursesModel->db->table('student_courses');
        $builder->join('students', 'students.student_id = student_courses.student_id');
        $builder->join('courses', 'courses.course_id = student_courses.course_id');
        $builder->select('students.reg_no, students.first_name, students.last_name, courses.course_code, courses.course_title');
        $query = $builder->get();
---
SELECT `students`.`reg_no`, `students`.`first_name`, `students`.`last_name`, `courses`.`course_code`, `courses`.`course_title`
FROM `student_courses`
JOIN `students` ON `students`.`student_id` = `student_courses`.`student_id`
JOIN `courses` ON `courses`.`course_id` = `student_courses`.`course_id`