app/Models/CoursesModel.php

SELECT *
FROM `courses`
---
    public function getCourses(){

        $builder = $this->db->table('courses');
        $query = $builder->get();

INSERT INTO `courses` (`course_code`, `course_title`, `credits`) VALUES ('EA3121', 'Robotics', '1')
---
    public function addCourse($data){

        $builder = $this->db->table('courses');
        $builder->insert($data);