app/Models/StudentsModel.php

SELECT *
FROM `students`
---
    public function getStudents(){

        $builder = $this->db->table('students');
        $query = $builder->get();

INSERT INTO `students` (`reg_no`, `first_name`, `last_name`, `name_with_initials`, `nic`) VALUES ('23sea110', 'apple', 'mango', 'A.mango', '12345678')
---
    public function addStudent($data){

        $builder = $this->db->table('students');
        $builder->insert($data);

INSERT INTO `student_courses` (`student_id`, `course_id`) VALUES ('2', '2')
---
    public function enrollCourse($student_id, $course_id){

        $builder = $this->db->table('student_courses');
        $data = [
            'student_id' => $student_id,
            'course_id' => $course_id
        ];
        $builder->insert($data);