app/Models/UsersModel.php

    public function getUserTypes(){

        $builder = $this->db->table('user_type');
        $query = $builder->get();
---
SELECT *
FROM `user_type`